[
	{
		"years": "",
		"language": "",
		"activity": ""
	},
	{
		"years": "",
		"language": "",
		"activity": ""
	},
	{
		"years": "2025",
		"language": "ES",
		"activity": "Presentación de trabajo en el XXII Congreso Regional de Física Estadística y Aplicaciones a la Materia Condensada (TREFEMAC XXII)"
	},
	{
		"years": "2025",
		"language": "ES",
		"activity": "Presentación de trabajo en el X Congreso de Matemática Aplicada, Computacional e Industrial (MACI X), Universidad Tecnológica Nacional Facultad Regional Córdoba"
	},
	{
		"years": "2025",
		"language": "ES",
		"activity": "Participación en el VI taller de Matemática en la Industria (TAMI VI), FaMAF, Universidad Nacional de Córdoba"
	},
	{
		"years": "2025",
		"language": "EN",
		"activity": "Courses of Full Stack at Coderhouse (Javascript, Web Development, Backend, React JS)"
	},
	{
		"years": "2020-2025",
		"language": "ES",
		"activity": "'Beca Interna Doctoral' otorgada por CONICET para financiar proyectos de doctorado a estudiantes graduados con el título 'Lógicas Epistémicas con Estrategias' con el Dr. Raúl Fervari (FaMAF-UNC, CONICET) como director"
	},
	{
		"years": "2024",
		"language": "EN",
		"activity": "Course 'Blender 3D' at Coderhouse"
	},
	{
		"years": "2020-2024",
		"language": "EN/ES",
		"activity": "PhD degree in Computer Science / Doctorado en Ciencias de la Computación, FaMAF, Universidad Nacional de Córdoba (Dr. Raúl Fervari)"
	},
	{
		"years": "2024",
		"language": "EN/ES",
		"activity": "Organizer at the Twelfth Argentine Workshop on Fundamentals for the Automatic Analysis and Construction of Software / Organizador en el Doceavo Taller Argentino de Fundamentos para el Análisis y la Construcción Automática de Software (FACAS), Universidad Nacional de Río Cuarto, Córdoba, Argentina"
	},
	{
		"years": "2024",
		"language": "EN",
		"activity": "Presentation of work at the International Workshop on Reconfigurable Transition Systems: Semantics, Logics and Applications (ReacTS), Aveiro, Portugal"
	},
	{
		"years": "2024",
		"language": "EN/ES",
		"activity": "Participation at Eleventh Argentine Workshop on Fundamentals for the Automatic Analysis and Construction of Software / Participación en el Onceavo Taller Argentino de Fundamentos para el Análisis y la Construcción Automática de Software (FACAS), Universidad Nacional de Río Cuarto, Córdoba, Argentina"
	},
	{
		"years": "2023",
		"language": "EN/ES",
		"activity": "2nd Seminar for PhD Computer Science students / Segundo seminario para estudiantes de doctorado, FaMAF, Universidad Nacional Córdoba, Argentina"
	},
	{
		"years": "2023",
		"language": "EN",
		"activity": "Presentation of work at the International Conference on Autonomous Agents and Multiagent Systems (AAMAS), London, United Kingdom"
	},
	{
		"years": "2023",
		"language": "EN",
		"activity": "Talk at São Paulo School of Advanced Science on Contemporary Logic, Rationality, and Information (SPLogIC), Universidade Estadual de Campinas, São Paulo"
	},
	{
		"years": "2020-2022",
		"language": "EN/ES",
		"activity": "University Technician in Applied Mathematics / Técnico Universitario en Matemática Aplicada, FaMAF, Universidad Nacional de Córdoba (GPA: 9.44/10)"
	},
	{
		"years": "2022",
		"language": "ES",
		"activity": "Trabajo como Profesor Ayudante A en la materia Algoritmos y Estructuras de Datos I, FaMAF, Universidad Nacional de Córdoba"
	},
	{
		"years": "2022",
		"language": "EN",
		"activity": "Presentation of work at DaLí Workshop, University of Lisbon, Portugal (virtual)"
	},
	{
		"years": "2022",
		"language": "ES",
		"activity": "Curso 'Álgebra Universal' dictado por el Dr. Miguel A. C. Campercholi (UNC, CONICET) y la Dra. Mariana Badano (UNC, CONICET)"
	},
	{
		"years": "2022",
		"language": "EN/ES",
		"activity": "Talk at the Ninth Argentine Workshop on Fundamentals for the Automatic Analysis and Construction of Software / Charla en el Noveno Taller Argentino de Fundamentos para el Análisis y la Construcción Automática de Software (FACAS), La Falda, Córdoba, Argentina"
	},
	{
		"years": "2021",
		"language": "EN",
		"activity": "Participation at the European Summer School In Logic, Language And Information (ESSLLI)"
	},
	{
		"years": "2021",
		"language": "EN/ES",
		"activity": "1st seminar for PhD Computer Science students / Primer seminario para estudiantes de doctorado, FaMAF, Universidad Nacional Córdoba, Argentina"
	},
	{
		"years": "2021",
		"language": "EN",
		"activity": "Presentation of work at the Eighteenth Conference on Theoretical Aspects of Rationality and Knowledge (TARK XVIII), Tsinghua University, China (virtual)"
	},
	{
		"years": "2021",
		"language": "ES",
		"activity": "Curso 'Teoría de Modelos' dictado por los doctores Miguel A. C. Campercholi (UNC, CONICET) y Diego N. Castaño (UNS, CONICET), Universidad Nacional de Córdoba (8/10)"
	},
	{
		"years": "2021",
		"language": "EN",
		"activity": "Course 'Introduction to Proof Theory' dictated by Dr. Anupam Das (University of Birmingham, United Kingdom), Midlands Graduate School in the Foundations of Computing Science (virtual)"
	},
	{
		"years": "2020",
		"language": "ES",
		"activity": "Curso 'Aspectos Modernos de Lógica Computacional' dictado por los doctores Carlos Areces (UNC, CONICET), Raúl Fervari (UNC, CONICET), Valentín Cassano (UNRC, UNC, CONICET), Pablo Castro (UNRC, CONICET) (10/10)"
	},
	{
		"years": "2019-2020",
		"language": "ES",
		"activity": "'Becas de Estímulo a las Vocaciones Científicas' otorgada por Consejo Interuniversitario Nacional (CIN) dada a estudiantes de grado que quieran iniciarse en investigación científica con el título 'Inferencia para Lógicas de Separación' con el Dr. Raúl Fervari (FaMAF-UNC, CONICET) como director"
	},
	{
		"years": "2015-2020",
		"language": "ES",
		"activity": "'Becas Académicas' otorgada por el Gobierno de la provincia de Córdoba a estudiantes que terminaron la escuela secundaria con los mejores promedios y que quieran estudiar en carreras estratégicas en Informática y Tecnologías de la Información y la Comunicación"
	},
	{
		"years": "2020",
		"language": "EN/ES",
		"activity": "University Award: Honorable mention degree for best GPA / Premio Universidad: Diploma con Mención de Honor por mejor promedio",
		"link": "https://digesto.unc.edu.ar/handle/123456789/122545"
	},
	{
		"years": "2015-2020",
		"language": "EN/ES",
		"activity": "Master's degree in Computer Science / Licenciatura en Ciencias de la Computación, FaMAF, Universidad Nacional de Córdoba (Dr. Raúl Fervari, GPA: 9.67/10)"
	},
	{
		"years": "2019",
		"language": "EN",
		"activity": "Internship working with Dr. Stéphane Demri in Modal Separation Logics LSV, ENS Cachan, France"
	},
	{
		"years": "2019",
		"language": "ES",
		"activity": "Trabajo como Ayudante Alumno en las materias de Algoritmos y Estructuras de Datos II e Introducción a la Lógica y a la Computación en FaMAF, Universidad Nacional de Córdoba",
		"link": ["https://digesto.unc.edu.ar/handle/123456789/127439","https://digesto.unc.edu.ar/handle/123456789/127614"]
	},
	{
		"years": "2019",
		"language": "ES",
		"activity": "Curso 'Lógicas Dinámicas' dictado por los doctores Carlos Areces (FaMAF-UNC, CONICET), Raul Fervari (FaMAF-UNC, CONICET) y Fernando R. Velázquez Quesada (ILLC, Netherlands), FaMAF, Universidad Nacional de Córdoba (10/10)"
	},
	{
		"years": "2019",
		"language": "ES",
		"activity": "Selección como suplente de 1ra escolta en la bandera nacional, FaMAF, Universidad Nacional de Córdoba",
		"link": "https://digesto.unc.edu.ar/handle/123456789/121853"
	},
	{
		"years": "2018",
		"language": "ES",
		"activity": "Curso 'Modelos Matemáticos en Finanzas Cuantitativas' dictado por la Dra. Patricia Kisbye y el Profesor Pedro Pury, FaMAF, Universidad Nacional de Córdoba (10/10)"
	},
	{
		"years": "2018",
		"language": "ES",
		"activity": "Curso 'Introducción a las Técnicas Estadísticas y Computacionales para el Procesamiento de Imágenes de Teledetección' dictado por el Ingeniero en Sistemas Sergio Masuelli (CONAE), FaMAF, Universidad Nacional de Córdoba (10/10)"
	},
	{
		"years": "2018",
		"language": "ES",
		"activity": "Selección como suplente de 2da escolta en la bandera nacional, FaMAF, Universidad Nacional de Córdoba",
		"link": "https://digesto.unc.edu.ar/handle/123456789/120965"
	},
	{
		"years": "2015-2017",
		"language": "EN/ES",
		"activity": "Undergraduate degree in Computer Analyst / Analista en Computación, FaMAF, Universidad Nacional de Córdoba (GPA: 9.61/10)"
	},
	{
		"years": "2017",
		"language": "ES",
		"activity": "Asistencia a la Escuela de Verano de Ciencias Informáticas RIO 2017, Universidad Nacional de Río Cuarto, Argentina"
	},
	{
		"years": "2017",
		"language": "ES",
		"activity": "Curso 'Criptografía' dictado por el Dr. Daniel Penazzi (FaMAF-UNC), Universidad Nacional de Río Cuarto, Argentina (10/10)"
	},
	{
		"years": "2017",
		"language": "ES",
		"activity": "Curso 'Principios de Cyberseguridad para entornos corporativos' dictado por INTEL Corporation, Universidad Nacional de Río Cuarto, Argentina (9/10)"
	},
	{
		"years": "2017",
		"language": "ES",
		"activity": "Asistencia al seminario 'Aprendiendo a programar en la escuela: Un análisis desde la política educativa' de la Dr. Ma. Cecilia Martínez (Inst. de Humanidades CONICET, FFyH, Universidad Nacional de Córdoba)"
	},
	{
		"years": "2017",
		"language": "ES",
		"activity": "Asistencia al seminario 'APIs REST: una puerta de entrada a tu software' de los Ingenieros en Software Marc Thurley y Matías Giorgio, Medallia Argentina"
	},
	{
		"years": "2017",
		"language": "ES",
		"activity": "Asistencia al seminario 'Machine Learning' del Líder Técnico e Ingeniero Franco Arito, MercadoLibre Argentina"
	},
	{
		"years": "2017",
		"language": "ES",
		"activity": "Participante en la comisión de clases de consulta organizada por el centro de estudiantes de FaMAFm Universidad Nacional de Córdoba"
	},
	{
		"years": "2012-2018",
		"language": "ES",
		"activity": "Participación en talleres de teatro adolescente en CCI María Castaña"
	},
	{
		"years": "2016",
		"language": "EN",
		"activity": "Cambridge's First Certificate in English (CEFR B2)"
	},
	{
		"years": "2009-2014",
		"language": "ES",
		"activity": "Título de Bachiller en Ciencias Sociales y Humanidades, Institución Escuti (8.27/10)"
	}
]